package com.company.backjoon;

// https://nerogarret.tistory.com/57

//하나의 빌딩을 세우고 왼쪽과 오른쪽에 여러 크기의 빌딩을 그려본 후에 지붕을 이어보니
// 왼쪽에서 보이는 경우는 기준이 되는 빌딩에서
// 기울기(기준빌딩크기  - 비교빌딩 크기) / ( 빌딩간의 거리 )가 점점 작아질 때 건물이
// 보이는 것이 가능하다.
// 오른쪽은 그 반대이다.

// tower block - 고층건물
public class TowerBlock {
    // 많은 고층 빌딩이 보이는 고층 빌딩으 찾는다
    // 빌딩의 총 갯수 = N
    // 빌딩 = 선분 표시
    // i번째 빌딩(1부터시작)은 (i,0)부터 (i,높이)의 선분으로 나타낸다

    // 첫째 줄 = 총 빌딩 갯수 , N <= 50
    // 둘째 줄 = 1번 빌딩부터 높이가 주어진다. 높이 = 1,000,000,000
    public static void main(String[] args) {

    }
}
